In [1]:
# Importing Libaries
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
# Import dataset
ds = pd.read_csv("raw_messy_dataset.csv")
ds

,Name,Age,Gender,Email,Join_Date,Salary,Department
0,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
1,Bob,40,M,user1@example.com,NaN,50000,Engineering
2,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
3,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
4,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering
...,...,...,...,...,...,...,...
100,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
101,Bob,40,M,user1@example.com,NaN,50000,Engineering
102,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
103,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
104,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering

In [3]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        105 non-null    object
 1   Age         72 non-null     object
 2   Gender      89 non-null     object
 3   Email       95 non-null     object
 4   Join_Date   70 non-null     object
 5   Salary      78 non-null     object
 6   Department  89 non-null     object
dtypes: object(7)
memory usage: 5.9+ KB

In [4]:
ds.describe()

         Name Age Gender              Email   Join_Date Salary   Department
count     105  72     89                 95          70     78           89
unique     10   5      5                 90           4      5            5
top     Alice  40   Male  user0@example.com  2021-05-21  50000  Engineering
freq       11  22     22                  2          26     22           26

In [5]:
# Searching for duplicates
ds.duplicated().sum()

np.int64(5)

In [6]:
# Remove duplicates
ds.drop_duplicates(inplace=True)

In [7]:
ds.columns   # It returns with columns Header

Index(['Name', 'Age', 'Gender', 'Email', 'Join_Date', 'Salary', 'Department'], dtype='object')

In [8]:
# Handing Age

ds["Age"]=pd.to_numeric(ds["Age"], errors= 'coerce')

In [9]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        100 non-null    object
 1   Age         57 non-null     float64
 2   Gender      86 non-null     object
 3   Email       90 non-null     object
 4   Join_Date   66 non-null     object
 5   Salary      74 non-null     object
 6   Department  84 non-null     object
dtypes: float64(1), object(6)
memory usage: 6.2+ KB

In [10]:
# filling missing values in age columns

x=ds["Age"].median()
ds["Age"].fillna(x,inplace=True)

C:\Users\JAYABHARATI\AppData\Local\Temp\ipykernel_2240\2244708108.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  ds["Age"].fillna(x,inplace=True)

In [11]:
# Age checking (cross check)
ds["Age"].unique()

array([35., 40., 30., 25.])

In [12]:
ds["Gender"].unique()

array([nan, 'M', 'Male', 'Other', 'Female', 'F'], dtype=object)

In [13]:
# standerized Gender column

ds["Gender"] = ds["Gender"].replace({"M":"Male","F":"Female","":"None"})

In [14]:
# Handling email column
ds["Email"].fillna("-", inplace=True)

C:\Users\JAYABHARATI\AppData\Local\Temp\ipykernel_2240\3284772301.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  ds["Email"].fillna("-", inplace=True)

In [15]:
# convert to datetime format
ds["Join_Date"] = pd.to_datetime(ds["Join_Date"], errors= 'coerce')

In [16]:
# Handling Salary column
ds["Salary"]=pd.to_numeric(ds["Salary"], errors= 'coerce')

In [17]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        100 non-null    object
 1   Age         100 non-null    float64
 2   Gender      86 non-null     object
 3   Email       100 non-null    object
 4   Join_Date   24 non-null     datetime64[ns]
 5   Salary      60 non-null     float64
 6   Department  84 non-null     object
dtypes: datetime64[ns](1), float64(2), object(4)
memory usage: 6.2+ KB

In [18]:
ds["Department"].unique()

array(['Admin', 'Engineering', 'HR', 'Sales', nan, 'Marketing'],
      dtype=object)

In [19]:
# Handling missing values form department column
y=ds["Department"].mode()[0]
ds["Department"].fillna(y,inplace=True)

C:\Users\JAYABHARATI\AppData\Local\Temp\ipykernel_2240\1237685862.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  ds["Department"].fillna(y,inplace=True)

In [20]:
# To save file
ds.to_csv("cleaned_csv")

In [21]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        100 non-null    object
 1   Age         100 non-null    float64
 2   Gender      86 non-null     object
 3   Email       100 non-null    object
 4   Join_Date   24 non-null     datetime64[ns]
 5   Salary      60 non-null     float64
 6   Department  100 non-null    object
dtypes: datetime64[ns](1), float64(2), object(4)
memory usage: 6.2+ KB